{"class_name": "Sequential", "keras_version": "2.2.4", "backend": "tensorflow", "config": {"name": "sequential_2", "layers": [{"class_name": "LSTM", "config": {"recurrent_dropout": 0.0, "recurrent_constraint": null, "use_bias": true, "return_state": false, "kernel_constraint": null, "dropout": 0.0, "dtype": "float32", "go_backwards": false, "units": 8, "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "implementation": 1, "activation": "relu", "recurrent_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unroll": false, "kernel_regularizer": null, "bias_regularizer": null, "stateful": false, "activity_regularizer": null, "recurrent_activation": "hard_sigmoid", "bias_constraint": null, "return_sequences": true, "name": "lstm_3", "unit_forget_bias": true, "batch_input_shape": [null, 3, 2]}}, {"class_name": "Dropout", "config": {"rate": 0.2, "noise_shape": null, "trainable": true, "name": "dropout_3", "seed": null}}, {"class_name": "LSTM", "config": {"recurrent_dropout": 0.0, "recurrent_constraint": null, "use_bias": true, "return_state": false, "kernel_constraint": null, "dropout": 0.0, "dtype": "float32", "go_backwards": false, "units": 8, "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "implementation": 1, "activation": "relu", "recurrent_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unroll": false, "kernel_regularizer": null, "bias_regularizer": null, "stateful": false, "activity_regularizer": null, "recurrent_activation": "hard_sigmoid", "bias_constraint": null, "return_sequences": true, "name": "lstm_4", "unit_forget_bias": true, "batch_input_shape": [null, 3, 2]}}, {"class_name": "Dropout", "config": {"rate": 0.2, "noise_shape": null, "trainable": true, "name": "dropout_4", "seed": null}}, {"class_name": "Flatten", "config": {"data_format": "channels_last", "trainable": true, "name": "flatten_2"}}, {"class_name": "Dense", "config": {"use_bias": true, "kernel_regularizer": null, "bias_constraint": null, "trainable": true, "units": 2, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "name": "dense_2", "kernel_constraint": null}}]}}