{"keras_version": "2.2.4", "config": {"layers": [{"config": {"kernel_regularizer": null, "bias_regularizer": null, "unit_forget_bias": true, "name": "lstm_19", "recurrent_constraint": null, "go_backwards": false, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "unroll": false, "return_state": false, "bias_constraint": null, "activity_regularizer": null, "recurrent_dropout": 0.0, "use_bias": true, "units": 8, "activation": "relu", "stateful": false, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_activation": "hard_sigmoid", "recurrent_regularizer": null, "implementation": 1, "batch_input_shape": [null, 3, 2], "return_sequences": true, "kernel_constraint": null, "dropout": 0.0, "trainable": true}, "class_name": "LSTM"}, {"config": {"seed": null, "name": "dropout_19", "trainable": true, "rate": 0.2, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"kernel_regularizer": null, "bias_regularizer": null, "unit_forget_bias": true, "name": "lstm_20", "recurrent_constraint": null, "go_backwards": false, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "unroll": false, "return_state": false, "bias_constraint": null, "activity_regularizer": null, "recurrent_dropout": 0.0, "use_bias": true, "units": 8, "activation": "relu", "stateful": false, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_activation": "hard_sigmoid", "recurrent_regularizer": null, "implementation": 1, "batch_input_shape": [null, 3, 2], "return_sequences": true, "kernel_constraint": null, "dropout": 0.0, "trainable": true}, "class_name": "LSTM"}, {"config": {"seed": null, "name": "dropout_20", "trainable": true, "rate": 0.2, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"data_format": "channels_last", "trainable": true, "name": "flatten_10"}, "class_name": "Flatten"}, {"config": {"kernel_regularizer": null, "bias_regularizer": null, "use_bias": true, "units": 2, "activation": "linear", "name": "dense_10", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_constraint": null, "trainable": true, "activity_regularizer": null}, "class_name": "Dense"}], "name": "sequential_10"}, "backend": "tensorflow", "class_name": "Sequential"}